### Revising the Select Query I

In [ ]:
select * from CITY where POPULATION>100000 and COUNTRYCODE='USA';

### Revising the Select Query II

In [ ]:
select NAME from CITY where POPULATION>120000 and COUNTRYCODE='USA';

### Select All

In [ ]:
select * from CITY;

### Select By ID

In [ ]:
select * from CITY where ID=1661;

### Japanese Cities' Attributes

In [ ]:
select * from CITY where COUNTRYCODE='JPN';

### Japanese Cities' Names

In [ ]:
select NAME from CITY where COUNTRYCODE='JPN';

### Weather Observation Station 1

In [ ]:
select CITY, STATE from STATION;

### Weather Observation Station 3

In [ ]:
select distinct CITY from STATION where mod(ID, 2) = 0; # mod in DB2

### Weather Observation Station 4

In [ ]:
select count(CITY)-count(distinct CITY) from STATION;

### Weather Observation Station 5

In [ ]:
select CITY, length(CITY) from STATION order by length(CITY) asc, CITY limit 1;
select CITY, length(CITY) from STATION order by length(CITY) desc, CITY limit 1;

### Weather Observation Station 6

In [ ]:
select distinct CITY from STATION where lower(left(CITY, 1)) in ('a', 'e', 'i', 'o', 'u');

### Weather Observation Station 7

In [ ]:
select distinct CITY from STATION where lower(right(CITY, 1)) in ('a', 'e', 'i', 'o', 'u');

### Weather Observation Station 8

In [ ]:
select distinct CITY from STATION where lower(left(CITY, 1)) in ('a', 'e', 'i', 'o', 'u') and lower(right(CITY, 1)) in ('a', 'e', 'i', 'o', 'u');

### Weather Observation Station 9

In [ ]:
select distinct CITY from STATION where lower(left(CITY, 1)) not in ('a', 'e', 'i', 'o', 'u');

### Weather Observation Station 10

In [ ]:
select distinct CITY from STATION where lower(right(CITY, 1)) not in ('a', 'e', 'i', 'o', 'u');

### Weather Observation Station 11

In [ ]:
select distinct CITY from STATION where lower(left(CITY, 1)) not in ('a', 'e', 'i', 'o', 'u') or lower(right(CITY, 1)) not in ('a', 'e', 'i', 'o', 'u');

### Weather Observation Station 12

In [ ]:
select distinct CITY from STATION where lower(left(CITY, 1)) not in ('a', 'e', 'i', 'o', 'u') and lower(right(CITY, 1)) not in ('a', 'e', 'i', 'o', 'u');

### Higher Than 75 Marks

In [ ]:
select NAME from STUDENTS where marks > 75 order by right(NAME, 3) asc, ID asc;

### Employee Names

In [ ]:
select NAME from EMPLOYEE order by NAME asc;

### Employee Salaries

In [ ]:
select NAME from EMPLOYEE where SALARY > 2000 and MONTHS < 10 order by EMPLOYEE_ID asc;

### Type of Triangle

In [ ]:
select case 
when A+B<=C or A+C<=B or B+C<=A then 'Not A Triangle'
when A=B and B=C and A=C then 'Equilateral'
when A=B or B=C or A=C then 'Isosceles'
else 'Scalene'
end
from TRIANGLES;

### The PADS

In [ ]:
select concat(concat(concat(NAME, '('), left(OCCUPATION, 1)), ')') from OCCUPATIONS order by NAME asc;

In [ ]:
select concat(concat(concat(concat('There are a total of ', count(OCCUPATION)), ' '), lower(OCCUPATION)),'s.') as N 
from OCCUPATIONS 
group by OCCUPATION 
order by N asc, OCCUPATION asc;

### Occupations

In [ ]:
# MySQL

WITH temp AS (
    SELECT *, ROW_NUMBER() OVER (PARTITION BY occupation ORDER BY name) AS row_num
    FROM Occupations
)

SELECT
    MAX(CASE WHEN occupation = 'Doctor' THEN name END) AS doctor,
    MAX(CASE WHEN occupation = 'Professor' THEN name END) AS professor,
    MAX(CASE WHEN occupation = 'Singer' THEN name END) As singer,
    MAX(CASE WHEN occupation = 'Actor' THEN name END) AS actor
FROM temp
GROUP BY row_num

In [ ]:
# MS SQL Server

WITH temp AS (
    SELECT ROW_NUMBER() OVER (PARTITION BY occupation ORDER BY name) AS row_num, *
    FROM Occupations
)

SELECT doctor, professor, singer, actor
FROM temp PIVOT (MAX(name) FOR occupation IN (Doctor, Professor, Singer, Actor)) AS pvt;

### Binary Tree Nodes

In [ ]:
select N, case 
when P is null then 'Root'
when (select count(*) from BST where P = t.N) > 0 then 'Inner'
else 'Leaf'
end
from BST t
order by N;

### New Companies

In [ ]:
select COMPANY_CODE, FOUNDER,
(select count(distinct LEAD_MANAGER_CODE) from LEAD_MANAGER where COMPANY_CODE = C.COMPANY_CODE),
(select count(distinct SENIOR_MANAGER_CODE) from SENIOR_MANAGER where COMPANY_CODE = C.COMPANY_CODE),
(select count(distinct MANAGER_CODE) from MANAGER where COMPANY_CODE = C.COMPANY_CODE),
(select count(distinct EMPLOYEE_CODE) from EMPLOYEE where COMPANY_CODE = C.COMPANY_CODE)
from COMPANY C
order by COMPANY_CODE;